{
  "architectures": [
    "InstructBlipForConditionalGeneration"
  ],
  "image_token_index": 32100,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "is_encoder_decoder": true,
  "model_type": "instructblip",
  "num_query_tokens": 32,
  "qformer_config": {
    "classifier_dropout": null,
    "model_type": "instructblip_qformer",
    "vocab_size": 30523
  },
  "text_config": {
    "architectures": [
      "T5ForConditionalGeneration"
    ],
    "bos_token_id": 1,
    "classifier_dropout": 0.0,
    "d_ff": 5120,
    "d_kv": 64,
    "d_model": 2048,
    "decoder_start_token_id": 0,
    "dense_act_fn": "gelu",
    "dropout_rate": 0.1,
    "eos_token_id": 1,
    "feed_forward_proj": "gated-gelu",
    "initializer_factor": 1.0,
    "is_encoder_decoder": true,
    "is_gated_act": true,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "n_positions": 512,
    "num_decoder_layers": 8,
    "num_heads": 32,
    "num_layers": 24,
    "output_past": true,
    "pad_token_id": 0,
    "relative_attention_max_distance": 128,
    "relative_attention_num_buckets": 32,
    "task_specific_params": {
      "summarization": {
        "early_stopping": true,
        "length_penalty": 2.0,
        "max_length": 200,
        "min_length": 30,
        "no_repeat_ngram_size": 3,
        "num_beams": 4,
        "prefix": "summarize: "
      },
      "translation_en_to_de": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to German: "
      },
      "translation_en_to_fr": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to French: "
      },
      "translation_en_to_ro": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to Romanian: "
      }
    },
    "tie_word_embeddings": false,
    "torch_dtype": "float32",
    "vocab_size": 0
  },
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0.dev0",
  "use_decoder_only_language_model": false,
  "video_token_index": 32101,
  "vision_config": {
    "dropout": 0.0,
    "initializer_factor": 1.0,
    "model_type": "instructblip_vision_model",
    "num_channels": 3
  }
}
